Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: གསང་བ་པའི་བདག་པོ་ཁྱོད་ནི་དེ་བཞིན་གཤེགས་པའི་ཞབས་འབྲིང་བ་ཉེ་བ་ན་འདུག་པ་ཡིན་ན་གསང་བའི་བདག་པོ་དེ་བཞིན་གཤེགས་པའི་གསང་བའི་གནས་གང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཡང་མ་ཡིན་ན། དེ་མ་ཡིན་པའི་སེམས་ཅན་ཐ་མལ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་པ་ལས་བརྩམས་ཏེ།
en: Lord of the Guhyakas, the places containing the secrets of the realized ones are not within the purview of the disciples or the solitary buddhas, so what need is there to speak of their being within the purview of ordinary beings either.

source: ཁྱོད་སྤོབས་པར་གྱིས་ཤིག །
en: Would you please use your inspired eloquence to shine light on them for us?”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་ཅང་མི་སྨྲ་བས་ཁས་བླངས་སོ། །
en: When this was said, Vajrapāṇi, Lord of the Guhyakas, remained silent.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་ཅང་མི་སྨྲ་བས་ཁས་བླངས་པར་རིག་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: So the bodhisattva Śāntamati, understanding that Vajrapāṇi, Lord of the Guhyakas, was going to remain silent, spoke to the Blessed One: “Blessed One, would you please encourage Vajrapāṇi, Lord of the Guhyakas, to give a teaching here in the assembly about the secrets of the realized ones?

source: བཅོམ་ལྡན་འདས་གང་དག་ཐོས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་རབ་ཏུ་དགའ་བར་གྱུར་ཏེ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཡང་དག་པར་སྒྲུབ་པ་དང་། དེ་བཞིན་གཤེགས་པའི་གསང་བ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བའི་སླད་དུ་བརྩོན་པར་བགྱིད་པར་དེ་བཞིན་གཤེགས་པའི་གསང་བ་འཁོར་འདི་ལ་འཆད་པར་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་སྤྲོ་བར་མཛད་དུ་གསོལ།
en: If the bodhisattvas of great courage could hear such a teaching, they would be delighted and they would work to acquire the constitutive factors of awakening and become diligent in the practice of perfecting the secrets of the realized ones.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གསང་བ་པའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའི་གསང་བ་དང་། དེ་བཞིན་གཤེགས་པའི་གསང་བ་འཁོར་འདི། ཉན་པར་འདོད་དེ་ཁྱོད་ལ་ངས་བསྐུལ་གྱིས།
en: The Blessed One then said to Vajrapāṇi, Lord of the Guhyakas, “Lord of the Guhyakas, the assembly wishes to hear about the secrets of the bodhisattvas and the secrets of the realized ones.

source: དེ་བཞིན་གཤེགས་པའི་གསང་བ་ལས་བརྩམས་ཏེ་འཁོར་འདིར་སྤོབས་པར་གྱིས་ཤིག །
en: Therefore, I request you to use your inspired eloquence to shine light on the secrets of the realized ones for this assembly.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་སངས་རྒྱས་ཀྱི་མཐུ་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་གསང་བ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་གསང་བ་རྣམས་ལ་གང་ཅུང་ཟད་འཇུག་པར་བགྱི་བ་ཙམ་ཞིག་བསྟན་པ་བདག་གིས་བསྟན་པར་བགྱིའོ། །
en: Vajrapāṇi replied to the Blessed One, “Blessed One, I will give a teaching about the secrets of the bodhisattvas and the secrets of the realized ones to whatever small degree that I have understood them, and this much through the majestic power and the empowering authority of the Buddha.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་བགྱི་ན་མཚན་མོ་མུན་པ་མུན་གནག་གི་ནང་ན་མར་མེའི་མཐུས་གཟུགས་སུ་གྱུར་པའི་རྣམ་པ་ཐམས་ཅད་གདའ་བ་དེ་བཞིན་དུ། བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་མཐུ་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་གསང་བ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་གསང་བ་རྣམས་ལ་གང་ཅུང་ཟད་འཇུག་པར་བགྱི་བ་ཙམ་བསྟན་པར་བགྱིའོ། །
en: Indeed, Blessed One, just as the empowering authority of a lamp can make all forms visible in the darkest depths of night, in that same way, Blessed One, through the majestic power and empowering authority of the Buddha, I will explain the secrets of the bodhisattvas and the secrets of the realized ones according to the small degree that I have understood them.”

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ཅི་ནས་བྱང་ཆུབ་སེམས་དཔའི་གསང་བ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་གསང་བ་རྣམས་ཐོས་ནས་མི་དངང་། མི་སྐྲག །སྐྲག་པར་མི་འགྱུར་བར་འཁོར་དེར་ལེགས་པར་འཁོད་ཅིག །
en: Vajrapāṇi, Lord of the Guhyakas, then said to the bodhisattva of great courage, Śāntamati, “Noble son, make sure that when you hear about the secrets of the bodhisattvas and realized ones, you do not become frightened, afraid, or terrified, and that you remain properly seated in the assembly.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ཀྱིས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ལ་སྨྲས་པ། གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པས་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་བཞི་གསུངས་ཏེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: Then the bodhisattva of great courage, Śāntamati, said to the entire assembly, “Friends, the Realized One has spoken of four mysteries.

source: ལས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། གླུ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བསམ་གཏན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སངས་རྒྱས་བསམ་གྱིས་མི་ཁྱབ་པའོ། །
en: They are the mystery of action, the mystery of speech, the mystery of concentration, and the mystery of a buddha.

source: ཡང་གྲོགས་པོ་དག་གང་གི་ཕྱིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་བཞི་རྣམ་པར་བཀོད་དེ་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་བཞིའི་ནང་ན་དེ་བཞིན་གཤེགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་མཆོག་ཏུ་གསུངས་སོ། །
en: Furthermore, friends, after having awakened to unsurpassable and perfect awakening, the Buddha set forth these four mysteries. Among these four, he has taught that the mystery of a realized one is the foremost.

source: གྲོགས་པོ་དག་དེ་ལ་ཁྱེད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། དེ་བཞིན་གཤེགས་པའི་བསམ་གྱིས་མི་ཁྱབ་པ་ཐོས་ནས་མི་དངང་། མི་སྐྲག །སྐྲག་པར་མི་འགྱུར་བར་བྱའོ། །
en: Friends, when you hear of the mystery of a bodhisattva and the mystery of a realized one, do not become frightened, afraid, or terrified.

source: ཐོས་ནས་ལྷག་པར་དགའ་བ་དང་། དད་པ་དང་། མཆོག་ཏུ་དགའ་བ་རྒྱ་ཆེར་བསྐྱེད་པར་བྱའོ། །
en: Instead, when you hear of them, you should generate an abundance of pleasure, serene faith, and great joy.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ཀྱིས་ཇི་ལྟར་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་བཞིན་གཤེགས་པའི་གསང་བ་ཉན་པ་ལ་མོས་པར་གྱུར་ཅིང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་ལྷའི་མེ་ཏོག་གིས་པུས་མོ་ནུབ་ཙམ་དུ་བཀྲམ་པར་གྱུར་པ་དེ་ལྟ་བུའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་སོ། །
en: This statement by the bodhisattva of great courage, Śāntamati, made the entire assembly eager to hear about the secrets of the realized ones, and in order to empower the assembly with empowering authority he then scattered heavenly flowers among the retinue until they covered the ground up to everyone’s knees.

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཞི་བའི་བློ་གྲོས་དེའི་ཕྱིར་ཤིན་ཏུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: Then Vajrapāṇi, Lord of the Guhyakas, spoke to the bodhisattva of great courage, Śāntamati: “In that case, Śāntamati, listen well and pay close attention.

source: བྱང་ཆུབ་སེམས་དཔའི་གསང་བའི་གནས་རྣམས་བཤད་པར་བྱའོ། །
en: I will now explain the secret places of the bodhisattvas.

source: ཞི་བའི་བློ་གྲོས་གང་ཚུན་ཅད་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དེ་ཚུན་ཅད་ཁོ་བོ་བྱང་ཆུབ་སེམས་དཔའི་ཞབས་འབྲིང་ན་འདུག་འདུག་ན་བྱང་ཆུབ་སེམས་དཔའི་ལུས་འགྱུར་བའམ།
en: Śāntamati, I have served as the Realized One’s close attendant from the time when he, as a bodhisattva, received the prediction of his future unsurpassable and perfect awakening from the realized one, the blessed Dīpaṃkara.

source: ལུས་ཚུལ་འཆོས་པ་ཁོ་བོས་ནམ་ཡང་མ་མཐོང་ངོ་། །
en: Since that time, I never witnessed any alteration of the bodhisattva’s body or any physical artifice whatsoever.

source: ངག་འགྱུར་བ་འམ། ངག་གི་ཁ་གསག་ཀྱང་མ་ཐོས་སོ། །
en: I never heard any alteration of the bodhisattva’s speech or any flattery either.

source: སེམས་འགྱུར་བ་འམ། སེམས་གཡོ་བ་ཡང་མ་མཐོང་ངོ་། །
en: I never witnessed any alteration of the bodhisattva’s mind or any dissimulation either.

source: དེ་ལུས་དང་ལུས་ཀྱི་སྤྱོད་ལམ་གྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ་ཚིག་ཏུ་ནི་མི་སྨྲའོ། །
en: He brought beings to maturity with his body and the demeanor of his body, and thus he did not speak at all.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་དེའི་ལུས་ཀྱི་སྤྱོད་ལམ་མཐའ་ཡས་མུ་མེད་པར་སྣང་སྟེ།
en: In order to bring beings to maturity, his bodily demeanor manifested itself infinitely and endlessly.

source: ཞི་བའི་བློ་གྲོས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་སྤྱོད་ལམ་ཇི་སྙེད་པ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་སྤྱོད་ལམ་ཡང་དེ་སྙེད་དུ་ལྷུན་གྱིས་གྲུབ་ཅིང་སྒྲིམ་པ་མེད་པར་གནས་སོ། །
en: “Śāntamati, the bodhisattvas’ bodily demeanor conforms to the bodily demeanor of all beings, spontaneously and effortlessly.

source: འདི་ལྟ་སྟེ། བསམ་གཏན་གྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་བསམ་གཏན་གྱི་སྤྱོད་ལམ་སྟོན་ཏོ། །
en: For example, to beings who need to be guided by concentration, they show the conduct of concentration.

source: རྒྱུད་ཀྱི་སྒྲ་དང་། གླུའི་དབྱངས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་རྒྱུད་ཀྱི་སྒྲ་དང་། གླུའི་དབྱངས་ཀྱི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided through playing stringed instruments and singing songs, they show the conduct of playing stringed instruments and singing songs.

source: ཁྱེའུས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ཁྱེའུའི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by boys, they show the conduct of boys.

source: བུ་མོས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་བུ་མོའི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by girls, they show the conduct of girls.

source: བུད་མེད་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་བུད་མེད་ཀྱི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by women, they show the conduct of women.

source: སྐྱེས་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་སྐྱེས་པའི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by men, they show the conduct of men.

source: གཞོན་ནུས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་གཞོན་ནུའི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by those who are young, they show the conduct of the young.

source: བར་མས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་བར་མའི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by those who are middle-aged, they show the conduct of the middle-aged.

source: རྒན་པོས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་རྒན་པོའི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by those who are elderly, they show the conduct of the elderly.

source: ཡན་ལག་མ་ཚང་བས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ཡན་ལག་མ་ཚང་བའི་སྤྱོད་ལམ་དང་།
en: “To beings who need to be guided by those whose limbs are deformed or missing, they show the conduct of those whose limbs are deformed or missing.

source: གདོལ་པ་རྐང་ལག་ཆད་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་གདོལ་པ་རྐང་ལག་ཆད་པའི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by untouchables whose hands or feet have been cut off, they show the conduct of untouchables whose hands or feet have been cut off.

source: ལྐུགས་པ་དང་། འཕྱེ་བོས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ལྐུགས་པ་དང་འཕྱེ་བོའི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by those who are mentally or physical disabled, they show the conduct of the mentally and physically disabled.

source: ལོང་བ་དང་། འོན་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ལོང་བ་དང་།
en: To beings who need to be guided by the blind and deaf, they show the conduct of the blind and deaf.

source: འོན་པའི་སྤྱོད་ལམ་དང་། སེམས་ཅན་དམྱལ་བ་པའི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་སེམས་ཅན་དམྱལ་བ་པའི་གཟུགས་ཀྱི་སྤྱོད་ལམ་དང་།
en: “To beings who need to be guided by the appearance of hell beings, they show the conduct of hell beings.

source: དུད་འགྲོའི་སྐྱེ་གནས་དང་གཤིན་རྗེའི་འཇིག་རྟེན་དང་མིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་མིའི་སྤྱོད་ལམ་དང་། ལྷས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ལྷའི་སྤྱོད་ལམ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་།
en: To beings who need to be guided by beings in the animal realm, or those in the realm of Yama, or by human beings, they show the conduct of beings in the animal realm, or those in the realm of Yama, or human beings.

source: ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་།
en: To beings who need to be guided by gods, they show the conduct of gods.

source: ལྟོ་འཕྱེ་ཆེན་པོས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: To beings who need to be guided by nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, or mahoragas, they show the conduct of nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas.

source: མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་སྤྱོད་ལམ་དང་། བརྒྱ་བྱིན་གྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་བརྒྱ་བྱིན་གྱི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by a śakra, they show the conduct of a śakra.

source: ཚངས་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ཚངས་པའི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by a brahmā, they show the conduct of a brahmā.

source: འཇིག་རྟེན་སྐྱོང་བས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་འཇིག་རྟེན་སྐྱོང་བའི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by the lokapālas, they show the conduct of the lokapālas.

source: འཁོར་ལོས་སྒྱུར་བས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་འཁོར་ལོས་སྒྱུར་བའི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by cakravartins, they show the conduct of cakravartins.

source: དགེ་སློང་གིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་དགེ་སློང་གི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by monks, they show the conduct of monks.

source: དགེ་སློང་མས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་དགེ་སློང་མའི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by nuns, they show the conduct of nuns.

source: དགེ་བསྙེན་གྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་དགེ་བསྙེན་གྱི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by laymen, they show the conduct of laymen.

source: དགེ་བསྙེན་མས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་དགེ་བསྙེན་མའི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by laywomen, they show the conduct of laywomen.

source: ཉན་ཐོས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ཉན་ཐོས་ཀྱི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by disciples, they show the conduct of disciples.

source: རང་སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་རང་སངས་རྒྱས་ཀྱི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by solitary buddhas, they show the conduct of solitary buddhas.

source: བྱང་ཆུབ་སེམས་དཔས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ལམ་དང་།
en: To beings who need to be guided by bodhisattvas, they show the conduct of bodhisattvas, and to beings who need to be guided by realized ones, they show the conduct of realized ones.

source: དེ་བཞིན་གཤེགས་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ལམ་སྟོན་ཏེ་གཟུགས་མེད་པ་ནི་མ་གཏོགས་སོ། །
en: However, none of that applies to beings in the formless realm.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གཟུགས་དང་། ཁ་དོག་དང་། སྤྱོད་ལམ་ཇི་སྙེད་པ་བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་དང་། ཁ་དོག་དང་། སྤྱོད་ལམ་ཡང་དེ་སྙེད་དུ་ལྷུན་གྱིས་གྲུབ་ཅིང་ཡོངས་སུ་མི་རྟོག་པར་ཀུན་དུ་གནས་སོ། །
en: “Śāntamati, in this manner the bodhisattvas’ physical appearance, caste, and demeanor conform spontaneously and involuntarily to the physical appearance, caste, and demeanor of all beings.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་མི་རྟོག་ཅིང་བཏང་སྙོམས་པ་དེ་ལུས་ཀྱིས་ལུས་ཀྱི་སྤྱོད་ལམ་སྟོན་མོད་ཀྱི་ལུས་ཀྱི་ཆོས་ཉིད་ལས་ཀྱང་མི་གཡོའོ། །
en: In this respect, even though bodhisattvas, who do not form concepts and are in a state of equanimity, display their physical demeanors with their bodies, they do not deviate from the true nature of the body.

source: ལུས་ཀྱིས་ལུས་ཀྱི་ལས་བྱེད་མོད་ཀྱི་ལུས་ཀྱི་དབེན་པ་ཡང་མི་འདོར་རོ། །
en: Although they perform physical actions with their bodies, they do not lose sight of the separateness of the body.

source: དེ་ལུས་ཡོངས་སུ་དག་པས་ལུས་ཀྱི་འོད་ཀྱིས་སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་ཐམས་ཅད་བདེ་བར་བྱེད་དོ། །
en: They bring joy to all hell beings with the radiance of their bodies brought about by the purification of their bodies.

source: ལུས་ལ་མི་ལྟ་བས་ཤ་ཟ་བའི་སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་ཤའི་ལོངས་སྤྱོད་གང་དང་གང་འདོད་པ་དེ་ལྟ་བུའི་ཤ་རྣམས་བདག་གི་ལུས་ལས་དེ་དག་ལ་བསྟབས་ནས་བདག་སྲོག་དང་ཕྲལ་ཏེ་སེམས་ཅན་དེ་དག་ལ་སྦྱིན་པར་བྱེད་དོ། །
en: With no concern for their bodies, they offer their own flesh to satisfy carnivorous beings who desire meat for sustenance. They do so despite the fact that in giving their flesh to such beings they give up their lives in the process.

source: ཁྲག་འཐུང་བ་རྣམས་ལ་ཁྲག་སྦྱིན་པར་བྱེད་དོ། །རྐང་ཟ་བ་རྣམས་ལ་རྐང་སྦྱིན་པར་བྱེད་དོ། །གཟི་བྱིན་ཟ་བ་རྣམས་ལ་གཟི་བྱིན་སྦྱིན་པར་བྱེད་དོ། །
en: They give their blood to those who drink blood, their bones to those who devour bones, and their physical vitality to those who consume the body’s vitality.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ཤའི་ལོངས་སྤྱོད་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་བདག་གི་ལུས་ལས་བསྟབས་ཏེ་སྲོག་དང་ཕྲལ་ནས་སེམས་ཅན་དེ་དག་ལ་སྦྱིན་པར་བྱེད་དོ། །
en: “Śāntamati, they nourish all beings with whatever kind of bodily nourishment they require, and do so from their own bodies, even at the cost of their lives.

source: དེའི་ལུས་ཚད་མེད་པ་ནི་ཆོས་ཀྱི་དབྱིངས་ཚོད་མེད་པའི་རྗེས་སུ་འགྲོ་བས་མི་ཟད་དོ། །
en: The infinitude of their bodies is not exhausted because it proceeds from the infinite nature of the realm of reality.

source: དེའི་ལུས་མི་ཟད་པ་མངོན་པར་སྒྲུབ་པ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མི་ཟད་པ་མངོན་པར་སྒྲུབ་པས་རབ་ཏུ་རིག་པར་འགྱུར་རོ། །
en: Their realization of inexhaustible bodies arises because they are well acquainted with the realization of the inexhaustible nature of dependent origination.

source: དེ་ལུས་ཀྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ།
en: They bring beings to maturity with their bodies.

source: གང་དག་འདོད་ཆགས་ལ་སྤྱོད་པའི་སྡུག་པའི་རྣམ་པ་དང་། མཚན་མར་འཛིན་པའི་སེམས་ཅན་དེ་དག་གི་མདུན་དུ་བུད་མེད་གཟུགས་བཟང་ཞིང་མཛེས་པ་བལྟ་ན་སྡུག་པ་སྟོན་ཏེ།
en: “In front of beings who actively pursue sense pleasures, who are attached to the signs and images of beauty, they appear as well-formed, beautiful, and attractive female bodies.

source: དེ་ལ་སེམས་ཅན་དེ་དག་ཆགས་པ་སྐྱེས་ནས་བྱུགས་ཤིང་ཀུན་ཏུ་བྱུགས་ཏེ་དེ་དག་པང་དུ་འཇོག་གོ །
en: When these beings become inflamed with passion, they caress them, massage them with oil, and sit on their laps.

source: དེ་དག་སྐྱེས་བུ་དེ་དག་གི་པང་དུ་སོང་བ་དང་རྙིས་ཤིང་སྐམས་ནས་འཆི་བའི་དུས་བྱེད་དོ། །
en: Then, as they are sitting on these men’s laps, they wither and decay.

source: མི་གཙང་ཞིང་དྲི་མི་ཞིམ་པར་གྱུར་པས་སྐྱེས་བུ་དེ་དག་དེས་ཡིད་བྱུང་ནས་བོར་ཏེ་སོང་བ་དང་། ཤི་བའི་རོ་དེ་དག་ཉིད་ལས་སྐྱེས་བུ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བའི་ཆོས་བསྟན་པ་དེ་ལྟ་བུ་ཡང་འབྱུང་ངོ་། །
en: They become putrid and foul-smelling corpses so that those men become disenchanted and push them aside, but then the teaching of the Dharma issues from those corpses in such a way that those men become impossible to turn back from unsurpassable and perfect awakening.

source: ཡང་ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའ་དེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལུས་ཀྱིས་ཁྱབ་པར་བྱས་ཏེ་སོར་མོའི་རྩེ་མོས་ཡུངས་འབྲུ་ལ་བྱ་བ་བཞིན་དུ་རིན་པོ་ཆེའི་གདུགས་ཀྱིས་ཁེབས་པར་བྱེད་དོ། །
en: “Furthermore, Śāntamati, such bodhisattvas can pervade this cosmos of a billion worlds with their body. They can cover it with a jeweled parasol or even with their finger just like someone can cover a mustard seed with a fingertip.

source: སྲེག་པའི་བསྐལ་པའི་མེ་ལག་པའི་སོར་མོས་གཡོགས་ཀྱང་དེའི་ལུས་ཉམས་པར་མི་འགྱུར་རོ། །
en: Even if their finger were to cover the fire that consumes the cosmos at the end of a cosmic age, their body would not be harmed.

source: དེ་ལུས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མཆོད་ཅིང་རིམ་གྲོ་བྱེད་དེ།
en: “With their bodies, they worship and serve the blessed buddhas.

source: མེ་ཏོག་གི་གདུགས་རི་རབ་ཙམ་དག་ཀྱང་འབུལ་ལོ། །དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་མེ་ཏོག་གི་སྐོན་བུ་དག་ཀྱང་འཐོར་རོ། །
en: In the act of worshiping the realized ones, they offer flowered parasols and baskets of flowers as large as Mount Meru.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་དེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྤོས་ཀྱི་འབྲུ་མར་གྱིས་གང་བའི་སྣོད་གཅིག་ཏུ་མོས་ཏེ། རི་རབ་ཙམ་གྱི་སྙིང་པོ་འབར་བར་བྱས་པའི་མར་མེ་འབར་བར་བྱེད་དོ། །
en: In the act of worshiping the realized ones, they light a lamp with this cosmos of a billion worlds as the vessel filled with fragrant oil and a blazing wick the size of Mount Meru.

source: དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་མར་མེ་འབར་བར་བྱེད་དོ། །
en: In the act of worshiping the realized ones, they light as many lamps as there are grains of sand in the river Ganges.

source: དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་རང་གི་ལུས་ཀྱང་རས་བཅོས་བུས་དཀྲིས་ནས་མར་དང་འབྲུ་མར་གྱིས་བསྐུས་ཏེ་མར་མེ་འབུད་དོ། །དེ་འབར་བར་གྱུར་པའི་ཚེ། སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏེ།
en: In the act of worshiping the realized ones, they wrap their very own bodies in linen cloth soaked with oil and clarified butter, and then they set it aflame, and when they are blazing, the fire emits a great light that pervades as many buddha realms as there are grains of sand in the river Ganges.

source: སེམས་ཅན་དག་གིས་ཀྱང་མཐོང་ཞིང་ཤེས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཁྱུ་མཆོག་ཏུ་གྱུར་པ་དེ་མཐོང་ནས་ཀྱང་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: Beings see it and recognize it, and when they see the majesty of such bodhisattvas, immeasurable, countless numbers of beings conceive the aspiration for unsurpassable and perfect awakening.

source: ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པས་རློམ་པའི་སེམས་ཅན་རྣམས་ལ་ཡང་བདག་གི་གཟུགས་ཚན་པོ་ཆེ་ཆེན་པོ་དང་། སྲེད་མེད་ཀྱི་བུ་དང་། ལག་ན་རྡོ་རྗེའི་གཟུགས་སུ་སྟོན་ཏེ།
en: “To beings made haughty by pride, conceit, and arrogance, these bodhisattvas make themselves appear in the form of Vajrapāṇi, a Nārāyaṇa, or a being with a great physique.

source: དེར་སེམས་ཅན་དེ་དག་སྤྲུལ་པས་འཇིགས་སྐྲག་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་མངོན་པར་འདུད་ཅིང་ཕྱག་འཚལ་ལོ། །
en: These arrogant beings become terrified of bodhisattvas who appear in this way, and they bow and prostrate themselves before them.

source: དེ་ལ་ཆོས་ཀྱང་ཉན་པར་འདོད་དོ། །
en: Then they wish to hear the Dharma from them.

source: གང་ཡང་གྲོང་ཁྱེར་ཆེན་པོ་དག་གི་དུར་ཁྲོད་ཆེན་པོ་སྲོག་ཆགས་བརྒྱ་སྟོང་དུ་མས་གང་བར་གྱུར་པ་དེར་ཡང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་བདག་གི་ལུས་ཆེན་པོ་ཤི་ཞིང་དུས་ལས་འདས་པར་སྟོན་ཏེ།
en: “In the huge cremation grounds of great cities, where many hundreds of thousands of animals roam, these bodhisattvas of great courage display their own mighty bodies when they have died.

source: དེར་ཡང་སེམས་ཅན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ་དེ་དག་གིས་ཅི་ཙམ་འདོད་པར་ཤ་ལ་ཟོས་ནས་ཚེའི་མཐར་ཕྱིན་ཏེ་འཆི་བའི་དུས་སུ་གྱུར་ཅིང་ཤི་ནས་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་ལྷའི་ནང་དུ་སྐྱེའོ། །དེ་ཡང་དེ་དག་གི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བར་གྱི་རྒྱུར་འགྱུར་རོ། །
en: The beings from the animal realm staying there feast on their flesh as much as they please, and then at the end of their lives, when their time comes to die, they are reborn among the gods of the higher realms and good places of rebirth.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཉིད་སྔོན་གྱི་སྨོན་ལམ་ཡོངས་སུ་དག་པའི་ཕྱིར་ཏེ་བདག་འཆི་བའི་དུས་སུ་གྱུར་ནས།
en: These bodhisattvas also become the cause of these beings’ eventual cessation, because of the purification of the previous vows of these bodhisattvas.

source: ཤི་བའི་ལུས་ལ་སེམས་ཅན་གང་དག་གིས་ཟོས་པ་དེ་དག་ལ་དེ་ཉིད་མཐོ་རིས་སུ་སྐྱེ་བ་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་གྱི་རྒྱུར་གྱུར་ཅིག་ཅེས་ཡུན་རིང་པོ་ནས་སྨོན་ལམ་བཏབ་སྟེ། ཚུལ་ཁྲིམས་དང་ལྡན་པ་དེ་བསམ་པ་འགྲུབ། འདོད་པ་འགྲུབ། སྨོན་པ་འགྲུབ་བོ། །
en: They have long ago formed the vow that if, when they die, beings feast on their dead bodies and this becomes the cause for them to be reborn in the higher realms until they pass beyond anguish, then, for those who have maintained moral conduct, they achieve their aspiration, they accomplish their desire, they fulfill their vow.

source: ཞི་བའི་བློ་གྲོས་རྣམ་གྲངས་འདིས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཚད་མེད་ཅིང་མཐའ་ཡས་པར་ཁྱོད་ཀྱིས་འདི་ལྟར་རིག་པར་བྱ་སྟེ།
en: “In precisely this manner, Śāntamati, you may understand the immeasurable and infinite nature of the bodhisattva’s body.

source: ཞི་བའི་བློ་གྲོས་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་འཛམ་བུའི་གླིང་དུ་གཏོགས་པ་ནམ་མཁས་བསྐོར་བ་འདི་ཉིད་དུ་གྲོང་ཁྱེར་བརྒྱད་ཁྲི་བཞི་སྟོང་པ་ཕྲག་བཞི་བྱུང་སྟེ།
en: “A long time ago, Śāntamati, under this very same sky here on Jambudvīpa, there were once eighty-four thousand cities divided into four parts.
